#+TITLE: Data management procedures for reproducible research pipelines 
#+AUTHOR: Ivan Hanigan
#+email: ivan.hanigan@anu.edu.au
#+LaTeX_CLASS: article
#+LaTeX_CLASS_OPTIONS: [a4paper]
#+LATEX: \tableofcontents
-----
*** COMMENT go
#+name:go
#+begin_src R :session *R* :tangle no :exports none :eval yes
#### name:go ####
  setwd("~/projects/swish-dmp/notes")
  rmarkdown::render("automating_boilerplate_EML_for_wide_data.Rmd", "html_document")  
  #browseURL("automating_boilerplate_EML_for_wide_data.html")

#+end_src

#+RESULTS: go
: /home/ivan_hanigan/projects/swish-dmp/notes/automating_boilerplate_EML_for_wide_data.html

** Run the Rmd
#+begin_src R :session **R** :tangle no :exports none :eval yes :padline yes
  
  # func
  setwd("~/projects/swish-dmp/swish_data_management_procedures")
  library(rmarkdown)
  library(knitr)
  library(knitcitations)
  library(bibtex)
  cleanbib()
  # rm("bib")
  #options("cite_format"="pandoc")
  cite_options(citation_format = "pandoc", check.entries=FALSE)
  
  #rmarkdown::render("swish-dmp-report.Rmd", "html_document")  
  rmarkdown::render("swish-dmp-report.Rmd", "pdf_document")
  # browseURL("swish-dmp-report.pdf")
  # browseURL("swish-dmp-report.html")
#+end_src  

#+RESULTS:
: /home/ivan_hanigan/projects/swish-dmp/swish_data_management_procedures/swish-dmp-report.pdf

